##はじめに------------------------------------------------------------------------------------------------------------------------
###作業ディレクトリ等については、サポートウェブサイトからダウンロードできる「同性愛者の割合」のRスクリプトを参照

#バージョンの確認（4.4.0で動作確認済）
R.version

##事前準備（使用するパッケージの呼び出し）---------------------------------------------------------------------------
packages <- c(
  "tidyverse",
)

for (package in packages) {
  if (!require(package, character.only = TRUE)) {
    install.packages(package)
    library(package, character.only = TRUE)
  }
}

##データの読み込み----------------------------------------------------------------------------------------------------
#Datにcsvファイルの内容を格納。header=TRUEで１行目をヘッダーとする
Dat <- read.csv(
  "https://www.fbc.keio.ac.jp/~tyabu/keiryo/gay_data.csv",
  header=TRUE
)
head(Dat)

##データの確認----------------------------------------------------------------------------------------------------
str(Dat) #データの属性を確認する
summary(Dat) #基本統計量を調べる


## 2.4節の推定結果----------------------------------------------------------------------------------------------------
Out1 <- lm(gay~support,data=Dat) #被説明変数をgay、説明変数をsupportとしたOLS推定
#lm(被説明変数~説明変数,data=使用データ)と入力する

summary(Out1) #上記のOLS推定の結果を表示

predict(Out1,newdata=data.frame(support=100)) #support=100としたときの予測値

## 散布図と標本相関係数----------------------------------------------------------------------------------------------------
par(family= "HiraKakuProN-W3")　#日本語表示を可能にするコマンド（2023/12/21時点での対処法）

plot(Dat$support,Dat$gay,main="散布図と回帰直線",
     xlab = "Support",ylab = "Gay", col = "red", pch = 19) #pch=19 で塗りつぶし丸印を指定

abline(Out1,col = "blue") #散布図に回帰直線を入れる

cor(Dat$support,Dat$gay) #相関係数「参照元データ$項目名」という形式