##はじめに------------------------------------------------------------------------------------------------------------------------
###作業ディレクトリ等については、サポートウェブサイトからダウンロードできる「同性愛者の割合」のRスクリプトを参照

#バージョンの確認（4.4.0で動作確認済）
R.version

##事前準備（使用するパッケージの呼び出し）---------------------------------------------------------------------------

##データの読み込み---------------------------------------------------------------------------
Dat <- read.csv(
  "https://www.fbc.keio.ac.jp/~tyabu/keiryo/stockprice_data.csv",
  header=TRUE
)
head(Dat)

##　7.3.3節の推定---------------------------------------------------------------------------
Out1<-lm(ds~ds_1+ds_2+ds_3+s_ma,data=Dat)
summary(Out1)
